# команда /start
message_start = (", я предназначен только для группы <pre>ПЗ-11</pre>"
                            f"\nХочешь узнать расписание? Напиши <code>!пары</code>, и я вышлю тебе фото."
                            f"\n\nТак же я умею пересылать ссылку на пары из одной группы в другую и закреплять сообщение там."
                            f"\nВесь функционал бота можно узнать по команде /help"
                            f"\n---\n👨‍💻 Код писали: \n<a href='tg://user?id=1051198514'>🔸Игорь</a>"
                            f"\n<a href='tg://user?id=562813685'>🔸Арсен</a>")

message_help = (', все команды указываются через !название команды или /название команды\n'
                            f"----------\n"
                            f'Список команд:\n'
                            f'🆔 !id | /!id - Показывает ваш id и id группы.\n'
                            f'🗓 !пары | /pr - Выдает меню где можно посмотреть расписание.\n'
                            f'🔔 !звонки | /call - Показывает расписание звонков.\n'
                            f'🎓 !студенты | /students - Список стдентов в группе ПЗ - 11.\n'
                            f'🎓 !фио | /fio - Показывает ФИО преподавателей\n'
                            f'👨‍💻 !разработчики | /adm - Показывает кто разработал этого бота.\n \n'
                            f'Если у вас есть предложения по улучшению бота-обращайтесь к разработчикам.')

# первая страница списка студентов
first_half = (f"🧑‍🎓1.  Бичков Михайло \n"   
        f"🧑‍🎓2. Білоусов Дмитро\n"   
        f"🧑‍🎓3. Богданов Олексій\n" 
        f"👩‍🎓4. Бочарова Вікторія\n"     
        f"🧑‍🎓5. Жукотський Микита\n"   
        f"🧑‍🎓6. Іванченко Богдан\n"   
        f"🧑‍🎓7. Ісаєнко  Гліб\n"  
        f"👩‍🎓8. Колесник Олександра\n"   
        f"🧑‍🎓9. Кудиненко Кирило\n"    
        f"🧑‍🎓10. Курило   Ярослав\n"  
        f"🧑‍🎓11. Мокренко Костянтин\n"    
        f"🧑‍🎓12. Мурадян Арсеній\n"   
        f"👩‍🎓13. Остапенко Анжела")  

# вторая страница списка студентов
second_half = (f"🧑‍🎓14. Петрик Олександр\n"
            f"🧑‍🎓15. Печеньов Артем\n"
            f"🧑‍🎓16. Полянський Руслан\n" 
            f"🧑‍🎓17. Прокудін Ігор\n"
            f"🧑‍🎓18. Пряницький Олексій\n"
            f"🧑‍🎓19. Рало Ілля\n"
            f"👩‍🎓20. Рябовол Диана\n"
            f"🧑‍🎓21. Страхов  Ігор\n"
            f"🧑‍🎓22. Сударев Игорь\n"
            f"🧑‍🎓23. Тарсуков Данило\n"
            f"👩‍🎓24. Царькова Дарина\n"
            f"🧑‍🎓25. Шахов Кирило\n"
            f"🧑‍🎓26. Шеховцов Роман\n"
            f"🧑‍🎓27. Шимкевич Ярослав")

call_message = (f" расписание звонков:"
                            f"\n1️⃣ пара: 8:30 - 9:50"
                            f"\n2️⃣ пара: 10:00 - 11:20"
                            f"\n3️⃣ пара: 11:50 - 13:10"
                            f"\n4️⃣ пара: 13:20 - 14:40"
                            f"\n5️⃣ пара: 14:50 - 16:10 ")
