# команда /start
message_start = (" я предназначен только для группы <pre>ПЗ-11</pre>"
                            f"\nХочешь узнать расписание? Напиши <code>!пары</code>, и я вышлю тебе фото."
                            f"\n\nТак же я умею пересылать ссылку на пары из одной группы в другую и закреплять сообщение там."
                            f"\nВесь функционал бота можно узнать по команде /help"
                            f"\n---\n👨‍💻 Код писали: \n<a href='tg://user?id=1051198514'>🔸Игорь</a>"
                            f"\n<a href='tg://user?id=562813685'>🔸Арсен</a>")

message_help = (', все команды указываются через !название команды или /название команды\n'
                            f"----------\n"
                            f'Список команд:\n'
                            f'🆔 !id | /!id - Показывает ваш id и id группы.\n'
                            f'🗓 !пары | /pr - Выдает меню где можно посмотреть расписание.\n'
                            f'🔔 !звонки | /call - Показывает расписание звонков.\n'
                            f'🎓 !студенты | /students - Список стдентов в группе ПЗ - 11.\n'
                            f'🎓 !фио | /fio - Показывает ФИО преподавателей\n'
                            f'👨‍💻 !разработчики | /adm - Показывает кто разработал этого бота.\n \n'
                            f'Если у вас есть предложения по улучшению бота-обращайтесь к разработчикам.')

# первая страница списка студентов
first_half = (f"🧑‍🎓1.  Бичков Михайло \n" 
        f"🧑‍🎓2. Бідило Віктор\n"
        f"🧑‍🎓3. Білоусов Дмитро\n"   
        f"🧑‍🎓4. Богданов Олексій\n" 
        f"👩‍🎓5. Бочарова Вікторія\n"     
        f"🧑‍🎓6. Жукотський Микита\n"   
        f"🧑‍🎓7. Іванченко Богдан\n"   
        f"🧑‍🎓8. Ісаєнко Гліб\n"  
        f"👩‍🎓9. Колесник Олександра\n"   
        f"🧑‍🎓10. Кудиненко Кирило\n"    
        f"🧑‍🎓11. Курило Ярослав\n"
        f"🧑‍🎓12. Медвидь Данило\n"
        f"🧑‍🎓13. Мокренко Костянтин\n"    
        f"🧑‍🎓14. Мурадян Арсеній\n")   
         

# вторая страница списка студентов
second_half = (f"👩‍🎓15. Остапенко Анжела\n"
            f"🧑‍🎓16. Петрик Олександр\n"
            f"🧑‍🎓17. Печеньов Артем\n"
            f"🧑‍🎓18. Полянський Руслан\n" 
            f"🧑‍🎓19. Прокудін Ігор\n"
            f"🧑‍🎓20. Пряницький Олексій\n"
            f"🧑‍🎓21. Рало Ілля\n"
            f"👩‍🎓22. Рябовол Диана\n"
            f"🧑‍🎓23. Страхов  Ігор\n"
            f"🧑‍🎓24. Сударев Игорь\n"
            f"👩‍🎓25. Царькова Дарина\n"
            f"🧑‍🎓26. Шахов Кирило\n"
            f"🧑‍🎓27. Шеховцов Роман\n"
            f"🧑‍🎓28. Шимкевич Ярослав")

call_message = (f" расписание звонков:"
                            f"\n1️⃣ пара: 8:30 - 9:50"
                            f"\n2️⃣ пара: 10:00 - 11:20"
                            f"\n3️⃣ пара: 11:50 - 13:10"
                            f"\n4️⃣ пара: 13:20 - 14:40"
                            f"\n5️⃣ пара: 14:50 - 16:10 ")
